src/cf/InformationRegisters/СостоянияCDNПлощадокМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияCDNПлощадокМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СреднееВремяПроверкиКМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднееВремяОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНедоступнаДоУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АдресПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияЛокальныхМодулейМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерверПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/РазрешительныйРежимМДЛПВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиРазрешительногоРежима

// Возвращает сохраненные настройки разрешительного режима.
//
// Возвращаемое значение:
//  Результат - Структура - См. РазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежимаПоУмолчанию().
//
Функция НастройкиРазрешительногоРежима() Экспорт
	
	Возврат РазрешительныйРежимМДЛП.НастройкиРазрешительногоРежима();
	
КонецФункции

#КонецОбласти // НастройкиРазрешительногоРежима

#Область ПроверкаКодаМаркировки

Функция НачатьПроверкуКМНаСервере(Знач ПараметрыВыполненияПроверки) Экспорт
	
	Возврат РазрешительныйРежимМДЛП.НачатьПроверкуКМНаСервере(ПараметрыВыполненияПроверки);
	
КонецФункции

#КонецОбласти // ПроверкаКодаМаркировки

#Область АварийныйРежим

// Включает аварийный режим на определенное пользователем время;
// Аварийный режим подразумевает полное отключение запросов к ГИС МТ и розничную продажу
// отслеживаемых товарных групп без проверок разрешительного режима.
//
// Параметры:
//  СрокДействияВЧасах - Число - Срок включения аварийного режима в часах
//
Процедура ВключитьАварийныйРежимРазрешительнойСистемы(СрокДействияВЧасах = 0) Экспорт
	// ор ++
	УстановитьПривилегированныйРежим(Истина);
	// ор --
	
	Настройки = РазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежима();
	
	УниверсальнаяДатаТекущая = ТекущаяУниверсальнаяДата();
	
	Если СрокДействияВЧасах = 0 И ЗначениеЗаполнено(Настройки.ЧастотаОбновленияCDNПлощадок) Тогда
		СрокДействияВЧасах = Настройки.ЧастотаОбновленияCDNПлощадок;
	ИначеЕсли СрокДействияВЧасах = 0 Тогда
		// пока нет особых рекомендаций, аварийный режим включается на сутки
		СрокДействияВЧасах = 24;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата)
		И УниверсальнаяДатаТекущая < Настройки.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата Тогда
		
		ДатаОкончанияАварийногоРежима = Настройки.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата + СрокДействияВЧасах * 3600;
		
	Иначе
		ДатаОкончанияАварийногоРежима = УниверсальнаяДатаТекущая + СрокДействияВЧасах * 3600;
	КонецЕсли;
	
	Настройки.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата = ДатаОкончанияАварийногоРежима;
	
	РазрешительныйРежимМДЛП.УстановитьНастройкиРазрешительногоРежима(Настройки);
	
	// ор ++
	ОбновитьПовторноИспользуемыеЗначения();
	УстановитьПривилегированныйРежим(Ложь);
	// ор --
КонецПроцедуры

// Отключает действие аварийного режима.
// Действие разрешительного режима возобновляется в штатном режиме.
//
Процедура ОтключитьАварийныйРежимРазрешительнойСистемы() Экспорт
	// ор ++
	УстановитьПривилегированныйРежим(Истина);
	// ор --
	
	Настройки = РазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежима();
	
	Настройки.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата = Дата(1, 1, 1);
	
	РазрешительныйРежимМДЛП.УстановитьНастройкиРазрешительногоРежима(Настройки);
	
	// ор ++
	ОбновитьПовторноИспользуемыеЗначения();
	УстановитьПривилегированныйРежим(Ложь);
	// ор --
КонецПроцедуры

#КонецОбласти // АварийныйРежим

#Область CDNПлощадки

Функция СортированнаяТаблицаCDNПлощадок() Экспорт
	
	Возврат РегистрыСведений.СостоянияCDNПлощадокМДЛП.СортированнаяТаблицаCDNПлощадок();
	
КонецФункции

Процедура ДобавитьCDNПлощадкиСОшибкамиОбменаВПараметрыСеанса(АдресПлощадки, МассивПлощадокКБлокировке, ЭтоОшибкаОтвета = Истина, ЭтоОтсутствиеОтвета = Ложь, ПлощадкаУжеДобавлена = Ложь) Экспорт
	
	ПлощадкиСОшибкамиОбмена = ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаМДЛП.Получить();
	
	Если ПлощадкиСОшибкамиОбмена = Неопределено Тогда
		
		ПлощадкиСОшибкамиОбмена = Новый Структура;
		ПлощадкиСОшибкамиОбмена.Вставить("ОшибкиПлощадки",      Новый Соответствие);
		ПлощадкиСОшибкамиОбмена.Вставить("НетОтветаПоПлощадке", Новый Соответствие);
		
	ИначеЕсли ТипЗнч(ПлощадкиСОшибкамиОбмена) = Тип("Массив") Тогда
		
		// Обратная совместимость - до изменения методических рекомендаций 15.11.2024 в площадках с ошибками обмена
		// был массив с площадками первых ошибок 500.
		ТекущийСписок = ОбщегоНазначения.СкопироватьРекурсивно(ПлощадкиСОшибкамиОбмена);
		
		ПлощадкиСОшибкамиОбмена = Новый Структура;
		ПлощадкиСОшибкамиОбмена.Вставить("ОшибкиПлощадки",      Новый Соответствие);
		ПлощадкиСОшибкамиОбмена.Вставить("НетОтветаПоПлощадке", Новый Соответствие);
		
		Для Каждого ТекущаяОшибочнаяПлощадка Из ТекущийСписок Цикл
			КоличествоОшибокПоПлощадке = 1;
			ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Вставить(ТекущаяОшибочнаяПлощадка, КоличествоОшибокПоПлощадке);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭтоОшибкаОтвета Тогда
		
		КоличествоОшибокПоПлощадке = ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Получить(АдресПлощадки);
		Если КоличествоОшибокПоПлощадке = Неопределено Тогда
			
			// Первая ошибка 5хх или 429 по площадке.
			КоличествоОшибокПоПлощадке = 1;
			ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Вставить(АдресПлощадки, КоличествоОшибокПоПлощадке);
			
		Иначе
			
			// Повторное получение ошибок по площадке.
			КоличествоОшибокПоПлощадке = КоличествоОшибокПоПлощадке + 1;
			ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Вставить(АдресПлощадки, КоличествоОшибокПоПлощадке);
			
		КонецЕсли;
		
		МаксимальноеКоличествоОшибокПоПлощадкеДляБлокировки = 2;
		Если КоличествоОшибокПоПлощадке >= МаксимальноеКоличествоОшибокПоПлощадкеДляБлокировки Тогда
			
			МассивПлощадокКБлокировке.Добавить(АдресПлощадки);
			
			ПлощадкаУжеДобавлена = Истина;
			
		КонецЕсли;
		
	ИначеЕсли ЭтоОтсутствиеОтвета Тогда
		
		КоличествоТаймаутовПоПлощадке = ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке.Получить(АдресПлощадки);
		Если КоличествоТаймаутовПоПлощадке = Неопределено Тогда
			
			// Первый таймаут по площадке.
			КоличествоТаймаутовПоПлощадке = 1;
			ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке.Вставить(АдресПлощадки, КоличествоТаймаутовПоПлощадке);
			
		Иначе
			
			// Повторное получение таймаута по площадке.
			КоличествоТаймаутовПоПлощадке = КоличествоТаймаутовПоПлощадке + 1;
			ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке.Вставить(АдресПлощадки, КоличествоТаймаутовПоПлощадке);
			
		КонецЕсли;
		
		МаксимальноеКоличествоТаймаутовПоПлощадкеДляБлокировки = 3;
		Если КоличествоТаймаутовПоПлощадке >= МаксимальноеКоличествоТаймаутовПоПлощадкеДляБлокировки Тогда
			
			МассивПлощадокКБлокировке.Добавить(АдресПлощадки);
			
			ПлощадкаУжеДобавлена = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаМДЛП = Новый ХранилищеЗначения(ПлощадкиСОшибкамиОбмена);
	
КонецПроцедуры

Процедура ПеренестиCDNПлощадкиСОшибкамиИзПараметровСеансаВРегистр(МассивПлощадокКБлокировке) Экспорт
	
	РегистрыСведений.СостоянияCDNПлощадокМДЛП.ЗаблокироватьСписокПлощадок(МассивПлощадокКБлокировке);
	
	// Все блокировки перенесены в регистр, надо убрать заблокированные площадки из массива Параметра сеанса
	ПлощадкиСОшибкамиОбмена = ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаМДЛП.Получить();
	
	Для Каждого ПлощадкаСОшибками Из ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки Цикл
		
		Если МассивПлощадокКБлокировке.Найти(ПлощадкаСОшибками.Ключ) <> Неопределено Тогда
			ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Удалить(ПлощадкаСОшибками.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ПлощадкаСТаймаутами Из ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке Цикл
		
		Если МассивПлощадокКБлокировке.Найти(ПлощадкаСТаймаутами.Ключ) <> Неопределено Тогда
			ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке.Удалить(ПлощадкаСТаймаутами.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаМДЛП = Новый ХранилищеЗначения(ПлощадкиСОшибкамиОбмена);
	
КонецПроцедуры

#КонецОбласти // CDNПлощадки

#Область ЛокальныйМодульЧЗ

Функция СортированнаяТаблицаЛокальныхМодулейЧестныйЗнак(Организация, РабочееМесто = Неопределено) Экспорт
	
	Возврат РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.СортированнаяТаблицаЛокальныхМодулейЧестныйЗнак(Организация, РабочееМесто);
	
КонецФункции

// Настройки основного подключения локальному модулю честный знак по ККТ.
//
// Параметры:
//  ПодключаемоеОборудованиеККТ - СправочникСсылка.ПодключаемоеОборудование - ссылка на ККТ
//
// Возвращаемое значение:
//  Структура:
//   * НастроеноПодключение - Булево - Истина, если настроено подключение к ЛМ ЧЗ
//   * Настройки - см. НастройкиПодключенияЛокальныхМодулейМДЛП.КонструкторПодключенияЛокальногоМодуляЧестныйЗнак
//
Функция НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоККТ(ПодключаемоеОборудованиеККТ) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПодключаемоеОборудованиеККТ, "Организация, РабочееМесто");
	
	Возврат НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Реквизиты.Организация, Реквизиты.РабочееМесто);
	
КонецФункции

// Возвращает наиболее приоритетную настройку подключения по ТС ПИоТу.
// Параметры:
//  Организация  - ОпределяемыйТип.ОрганизацияБПО, СправочникСсылка.ОрганизацииМДЛП - организация для отправки запроса в ЛМ.
//  РабочееМесто - СправочникСсылка.РабочиеМеста - рабочее место для получения запроса.
// 
// Возвращаемое значение:
//  Структура:
//  * НастроеноПодключение - Булево - Истина, если настроено подключение к ЛМ ЧЗ
//  * Настройки - см. НастройкиПодключенияЛокальныхМодулейМДЛП.КонструкторПодключенияЛокальногоМодуляЧестныйЗнак
//
Функция НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Организация, РабочееМесто = Неопределено) Экспорт
	
	ТипОрганизацииБПО = Метаданные.ОпределяемыеТипы.ОрганизацияБПО.Тип;
	Если ТипОрганизацииБПО.СодержитТип(ТипЗнч(Организация)) Тогда
		ОрганизацияМДЛП = ИнтеграцияМДЛПВызовСервера.ОрганизацияМДЛППоОрганизации(Организация);
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.ОрганизацииМДЛП") Тогда
		ОрганизацияМДЛП = Организация;
	Иначе
		ОрганизацияМДЛП = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОрганизацияМДЛП) Тогда
		ТекстОшибки = НСтр("ru = 'Не установлено однозначное соответствие организации ""%1"" в настройках соответсвий субъектов обращения для ИС МДЛП.'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Организация);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(ОрганизацияМДЛП, РабочееМесто);
	
КонецФункции

// Зафиксировать факт продажи/возврата марок из списка в локальной базе Локального модуля Честный знак.
//
// Параметры:
//  ДанныеКодовМаркировки - Массив Из Строка - массив нормализованных кодов для записи в ЛМ ЧЗ
//  Операция - Строка - признак пробития чека возврата или продажи
//  НастройкиПодключенияЛокальногоМодуля - см. НастройкиПодключенияЛокальныхМодулейМДЛП.КонструкторПодключенияЛокальногоМодуляЧестныйЗнак
//
Процедура ЗафиксироватьФактПродажиВозвратаКодовМаркировки(ДанныеКодовМаркировки, Операция, НастройкиПодключенияЛокальногоМодуля) Экспорт
	
	РезультатФиксацииПродажи = РазрешительныйРежимМДЛПКлиентСервер.ЗафиксироватьФактПродажиВозвратаКодовМаркировки(ДанныеКодовМаркировки, Операция, НастройкиПодключенияЛокальногоМодуля);
	ТекстОшибки              = "";
	
	Если РезультатФиксацииПродажи.НезавершеннаяНастройкаЛМ Тогда
		
		ТекстОшибки = НСтр("ru = 'Настройка по Локальному модулю Честный знак не завершена.
			|Невозможно зафиксировать локально факт продажи/возврата марок.'");
		
	ИначеЕсли РезультатФиксацииПродажи.НекорректныеДанныеАвторизации Тогда
		
		ТекстОшибки = НСтр("ru = 'Некорректные данные авторизации в настройке Локального модуля Честный знак.
			|Невозможно зафиксировать локально факт продажи/возврата марок.'");
		
	ИначеЕсли РезультатФиксацииПродажи.ОтсутствиеСинхронизацииЛМ Тогда
		
		ТекстОшибки = НСтр("ru = 'Статус Локального модуля Честный знак - ошибка синхронизации.
			|Невозможно зафиксировать локально факт продажи/возврата марок.'");
		
	ИначеЕсли ЗначениеЗаполнено(РезультатФиксацииПродажи.ТекстОшибки) Тогда
		
		ТекстОшибки = РезультатФиксацииПродажи.ТекстОшибки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ИмяСобытия = НСтр("ru = 'Локальная фиксация факта продажи/возврата марок'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение, РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП,, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЛокальныйМодульЧЗ

#Область Авторизация

Функция ПроверитьОбновитьКлючСессии(ПараметрыЗапроса, Знач СрокДействия = Неопределено, ОбновлятьКлючСессииНаСервере = Истина) Экспорт
	
	Возврат РазрешительныйРежимМДЛП.ПроверитьОбновитьКлючСессии(ПараметрыЗапроса, СрокДействия, ОбновлятьКлючСессииНаСервере);
	
КонецФункции

Функция ЗапроситьПараметрыАвторизации(ПараметрыЗапроса) Экспорт
	
	Возврат РазрешительныйРежимМДЛП.ЗапроситьПараметрыАвторизации(ПараметрыЗапроса);
	
КонецФункции

Функция ЗапроситьКлючиСессий(ПараметрыЗапросовПоОрганизациям) Экспорт
	
	Возврат РазрешительныйРежимМДЛП.ЗапроситьКлючиСессий(ПараметрыЗапросовПоОрганизациям);
	
КонецФункции

#КонецОбласти // Авторизация

#Область Логирование

Функция ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, КодОшибки, ПолныйКодМаркировки, ТекстОтвета, ТекстЗапроса, ДатаПолученияЗапроса = Неопределено, ИдентификаторЗапросаРазрешения = "") Экспорт
	
	ПараметрыЗаписиВЛог = ПараметрыЗаписиОперацииПроверкиКМ();
	
	Если ДатаПолученияЗапроса = Неопределено Тогда
		ДатаПолученияЗапроса = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	ПараметрыЗаписиВЛог.АдресСервераЗапросаРазрешения  = АдресСервера;
	ПараметрыЗаписиВЛог.ИдентификаторЗапросаРазрешения = ИдентификаторЗапросаРазрешения;
	ПараметрыЗаписиВЛог.ВремяЗапросаРазрешения         = ДатаПолученияЗапроса;
	ПараметрыЗаписиВЛог.ЗапросРазрешенияПродажиКМ      = Истина;
	ПараметрыЗаписиВЛог.КодОтветаРазрешения            = КодОшибки;
	ПараметрыЗаписиВЛог.КонтрольнаяМарка               = СтрЗаменить(ПолныйКодМаркировки, Символ(29), "'GS'");
	ПараметрыЗаписиВЛог.РезультатЗапросаРазрешения     = ТекстОтвета;
	ПараметрыЗаписиВЛог.ТекстЗапросаРазрешения         = ТекстЗапроса;
	
	Возврат ПараметрыЗаписиВЛог;
	
КонецФункции

Функция ПараметрыЗаписиОперацииПроверкиКМ()
	
	Если КонтрольКодовМаркировкиМДЛПКлиентСерверПовтИсп.ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом() Тогда
		
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияМаркировка");
		Результат = МодульМенеджерОборудованияМаркировка.ПараметрыЗаписиОперацииПроверкиКМ();
		
	Иначе
		
		Результат = Новый Структура;
		Результат.Вставить("Наименование",                   "");
		Результат.Вставить("КонтрольнаяМарка",               "");
		Результат.Вставить("ЗапросРазрешенияПродажиКМ",      Истина);
		Результат.Вставить("АдресСервераЗапросаРазрешения",  "");
		Результат.Вставить("ТекстЗапросаРазрешения",         "");
		Результат.Вставить("КодОтветаРазрешения",            "");
		Результат.Вставить("РезультатЗапросаРазрешения",     "");
		Результат.Вставить("ИдентификаторЗапросаРазрешения", "");
		Результат.Вставить("ВремяЗапросаРазрешения",         Неопределено);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЛогироватьРезультатыОперацийПроверкиКМ(ДанныеДляЛогирования) Экспорт
	
	Если КонтрольКодовМаркировкиМДЛПКлиентСерверПовтИсп.ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом() Тогда
		
		Для Каждого ДанныеПоКМ Из ДанныеДляЛогирования Цикл
			
			МодульМенеджерОборудованияМаркировка = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияМаркировка");
			МодульМенеджерОборудованияМаркировка.ДобавитьЗаписьВЖурналОперацийПроверкиКМ(ДанныеПоКМ);
			
		КонецЦикла;
		
	Иначе
		
		ШаблонИнформацииПоКМ = 
			НСтр("ru = 'Код ответа: [КодОтветаРазрешения]
				|Адрес сервера: [АдресСервераЗапросаРазрешения]
				|Текст запроса: [ТекстЗапросаРазрешения]
				|Текст ответа: [РезультатЗапросаРазрешения]
				|Идентификатор запроса: [ИдентификаторЗапросаРазрешения]
				|Время запроса: [ВремяЗапросаРазрешения]'");
		
		Для Каждого ДанныеПоКМ Из ДанныеДляЛогирования Цикл
			
			ТекстИнформацииПоКМ = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонИнформацииПоКМ, ДанныеПоКМ);
			
			КонтрольКодовМаркировкиМДЛПВызовСервера.ЗаписатьСобытиеВЖурналРегистрации(ТекстИнформацииПоКМ, СобытиеЖурналаРегистрацииПроверкиКМ());
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СобытиеЖурналаРегистрацииПроверкиКМ()
	
	Возврат НСтр("ru = 'Разрешительный режим.Операция проверки КМ'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти // Логирование

#Область Прочее

Функция ПолучитьНомерФискальногоНакопителяУстройства(ИдентификаторУстройства) Экспорт
	
	Если Не ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
		Возврат "";
	КонецЕсли;
	
	МодульОборудованиеЧекопечатающиеУстройства = ОбщегоНазначения.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройства");
	
	ПараметрыРегистрации = МодульОборудованиеЧекопечатающиеУстройства.ПараметрыРегистрацииУстройства(ИдентификаторУстройства);
	
	НомерФискальногоНакопителя = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыРегистрации, "ЗаводскойНомерФН");
	
	Если Не ЗначениеЗаполнено(НомерФискальногоНакопителя) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат НомерФискальногоНакопителя;
	
КонецФункции

#КонецОбласти // Прочее

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
